tests/Message/Wallet/Mock/CreateWalletSuccess.txt

HTTP/1.1 201 Created
Date: Thu, 28 Aug 2025 07:56:13 GMT
Content-Type: application/json; charset=utf-8
Content-Length: 1493
Connection: keep-alive
x-powered-by: PayDock <paydock.com>
access-control-allow-origin: *
vary: Origin
x-monitoring-acl-permission: charges:wallet-create
x-monitoring-acl-company-id: 677efbdee4411a5bd12d54a7
x-monitoring-acl-brand-id: 66504a25689973cb3240d6c5
x-monitoring-acl-global-id: 000000000000000000000001
x-monitoring-acl-ip: 123.103.220.210
x-monitoring-acl-scope: company
x-monitoring-acl-scope-id: 677efbdee4411a5bd12d54a7
x-external-duration: 0
x-retry-delay: 0
x-correlation-id: 00699da4-538e-40cc-819d-ed37d04d2152
etag: W/"5d5-anLJuZa5IK1yr5wz5PYYwAKcmAI"
Strict-Transport-Security: max-age=31536000; includeSubDomains

{"status":201,"error":null,"resource":{"type":"charge","data":{"token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY4YjAwYjlkMmNkYzIxZThkZGJiZmQ2MiIsIm1ldGEiOiJleUp0WlhSaElqcDdJbU5vWVhKblpTSTZleUpwWkNJNklqWTRZakF3WWpsa01qSTBNak5oTnpkak1UVTNOamN6T1NJc0ltRnRiM1Z1ZENJNk1UQXdNQ3dpWTNWeWNtVnVZM2tpT2lKQlZVUWlMQ0pqWVhCMGRYSmxJanAwY25WbExDSnlaV1psY21WdVkyVWlPaUprWVRSa1lUbGxZUzFtTTJSaExUUmxZMkl0T1dZMll5MDFNalE1WlRKbE9EUmpPVFFpZlN3aVoyRjBaWGRoZVNJNmV5SjBlWEJsSWpvaVRXRnpkR1Z5UTJGeVpDSXNJbTF2WkdVaU9pSjBaWE4wSWl3aVkzSmxaR1Z1ZEdsaGJITWlPbnNpWjI5dloyeGxJanA3SW0xbGNtTm9ZVzUwSWpvaVZFVlRWRWxPUnlKOWZYMHNJbU55WldSbGJuUnBZV3h6SWpwN0ltZHZiMmRzWlNJNmV5SnRaWEpqYUdGdWRDSTZJbFJGVTFSSlRrY2lmWDE5ZlE9PSIsImlhdCI6MTc1NjM2Nzc3MywiZXhwIjoxNzU2NDU0MTczfQ.33QOfXSViw9no0SnlVbDj5kwfuVY2VOXOjZhlCCfJMQ","charge":{"_id":"68b00b9d22423a77c1576739","amount":1000,"currency":"AUD","reference":"da4da9ea-f3da-4ecb-9f6c-5249e2e84c94","company_id":"677efbdee4411a5bd12d54a7","description":"BED-000000061","type":"financial","status":"wallet_initialized","capture":true,"authorization":false,"one_off":true,"created_at":"2025-08-28T07:56:13.805Z","updated_at":"2025-08-28T07:56:13.805Z","schedule":{"stopped":false},"archived":false,"meta":{},"customer":{"last_name":"Last","first_name":"First","email":"cam@exmple.com","payment_source":{"type":"wallet","wallet_type":null,"gateway_id":"677f1727cf73ceed6dde9e44","gateway_name":"MasterCard","gateway_type":"MasterCard"}},"transactions":[],"shipping":{},"items":[]}}}}